DataProcessors/ЛБ_СозданиеНакладныхНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_СозданиеНакладныхНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкиСозданияНакладныхНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкиСозданияНакладныхНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНеделиРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОграничениеОценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеВключениеЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейДоступнаОтгрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПереносСозданияНакладныхНаОгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереносСозданияНакладныхНаОгрузку</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_СозданиеНакладныхНаОтгрузку/Ext/ObjectModule.bsl
Перем ПроизводственныйКалендарь Экспорт;  
Перем ДокументНастроек Экспорт;

Процедура СоздатьНакладные() Экспорт 
	Если НЕ ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не найден основной производственный календарь!");
		Возврат;
	КонецЕсли;

	ДатаСоздания = ЭтотОбъект.Дата;  
	ТекущийДеньНедели = ДеньНедели(ДатаСоздания);
	
	//Проверим нужно ли создавать накладные
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаСоздания); 
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ДеньНедели КАК ДеньНедели,
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ПорядокВыбораДня КАК ПорядокВыбораДня,
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ЕстьОграничениеОценки КАК ЕстьОграничениеОценки,
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.Регистратор КАК ДокументНастроек
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();  
	ДеньНедели = 0;
	Если Выборка.Следующий() тогда
		ДеньНедели = Выборка.ДеньНедели; 
		ПорядокВыбораДня = Выборка.ПорядокВыбораДня;
		ЕстьОграничениеОценки = Выборка.ЕстьОграничениеОценки;
		СуммаОценки = Выборка.СуммаОценки;  
		ДокументНастроек = Выборка.ДокументНастроек;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не найдены настройки создания накладных на отгрузку на " + Формат(ДатаСоздания, "ДФ=dd.MM.yyyy"));  
		Возврат;
	КонецЕсли;	
	
	Если ДеньНедели = ТекущийДеньНедели  Тогда           				
		ОтборК = Новый Структура;  
		ОтборК.Вставить("Год",                       Год(ДатаСоздания));
		ОтборК.Вставить("Дата",                      ДатаСоздания);
		ОтборК.Вставить("ПроизводственныйКалендарь", ПроизводственныйКалендарь);

		СведенияНаДень=РегистрыСведений.ДанныеПроизводственногоКалендаря.Получить(ОтборК);
		Если НЕ СведенияНаДень.ВидДня=Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И НЕ СведенияНаДень.ВидДня=Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда 
			ДатаПереноса = ПеренестиДатуСозданияНаРабочийДень(ДатаСоздания);
			ОбщегоНазначения.СообщитьПользователю("Дата создания накладных на огрузку перенесена на " + Формат(ДатаПереноса, "ДФ=dd.MM.yyyy"));
		Иначе	
			КолНакладных = ВыполнитьСозданиеНакладныхНаОтгузку(ДатаСоздания, ДатаСоздания, ПорядокВыбораДня, ?(ЕстьОграничениеОценки, СуммаОценки, 0));
			ОбщегоНазначения.СообщитьПользователю("Создано накладных на отгрузку " + Строка(КолНакладных));
		КонецЕсли; 
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПереносСозданияНакладныхНаОгрузкуСрезПоследних.ДатаПереноса КАК ДатаПереноса,
		               |	ЛБ_ПереносСозданияНакладныхНаОгрузкуСрезПоследних.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПереносСозданияНакладныхНаОгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_ПереносСозданияНакладныхНаОгрузкуСрезПоследних";
		ВыборкаД = Запрос.Выполнить().Выбрать();
		Если ВыборкаД.Следующий() Тогда
			Если ВыборкаД.ДатаПереноса = НачалоДня(ДатаСоздания) Тогда 
				КолНакладных = ВыполнитьСозданиеНакладныхНаОтгузку(ДатаСоздания, ВыборкаД.Период, ПорядокВыбораДня, ?(ЕстьОграничениеОценки, СуммаОценки, 0));
				ОбщегоНазначения.СообщитьПользователю("Создано накладных на отгрузку " + Строка(КолНакладных));
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	 
	ОбщегоНазначения.СообщитьПользователю("Обработка завершена.");
КонецПроцедуры	

Функция ПеренестиДатуСозданияНаРабочийДень(Дата)
	ДатаПереноса = КонецДня(Дата)+1;  
	НашлиРабочийДень = Ложь;
	Пока НЕ НашлиРабочийДень Цикл
		ОтборК = Новый Структура;  
		ОтборК.Вставить("Год",                       Год(ДатаПереноса));
		ОтборК.Вставить("Дата",                      ДатаПереноса);
		ОтборК.Вставить("ПроизводственныйКалендарь", ПроизводственныйКалендарь);

		СведенияНаДень=РегистрыСведений.ДанныеПроизводственногоКалендаря.Получить(ОтборК);
		Если НЕ СведенияНаДень.ВидДня=Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И НЕ СведенияНаДень.ВидДня=Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда 
			ДатаПереноса = КонецДня(Дата)+1;
		Иначе 
			НашлиРабочийДень = Истина;
		КонецЕсли;	
	КонецЦикла; 
	
	МенеджерЗаписи = РегистрыСведений.ЛБ_ПереносСозданияНакладныхНаОгрузку.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = ЭтотОбъект.Дата;
	МенеджерЗаписи.Организация = ЭтотОбъект.Организация;
	МенеджерЗаписи.ДатаПереноса = ДатаПереноса;

	МенеджерЗаписи.Записать();  
	Возврат ДатаПереноса;
КонецФункции	   

Функция ПроверитьЗБНаследство(ЗалоговыйБилет, Дата)
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", ЗалоговыйБилет.Залогодатель);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	Запрос.Текст  = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ЛБ_КонтактнаяИнформацияЗалогодателей.Период КАК Период
	                |ИЗ
	                |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	                |		ПО ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
	                |ГДЕ
	                |	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Клиент
	                |	И НЕ ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти = &ПустаяДата
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();   
	Если Выборка.Следующий() Тогда 
	    ДатаПроверкиНаследство = КонецДня(Выборка.Период) + 1;
		ДатаПроверкиНаследство = ДобавитьМесяц(ДатаПроверкиНаследство, 8);
		Если ДатаПроверкиНаследство > НачалоДня(Дата) Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	

	Возврат Ложь;
КонецФункции

//+Мельников 04.07.24
Функция ПроверитьКлиентаНаБанкротство(ЗБ, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И Статус.Несостоятельный = ИСТИНА) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Залогодатель", ЗБ.Залогодатель);
	//Запрос.УстановитьПараметр("Статус", Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоКоду("000000003"));
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Используется;
	Иначе
		Возврат Ложь;
	КонецЕсли;;
	
КонецФункции
//-Мельников

&НаСервере
Функция ПроверитьНетБлокировки(ЗБ, Дата)
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ЗБ", ЗБ);  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних.ДатаБлокировки КАК ДатаБлокировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЗалоговыеБилетыЗаблокированные.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.Блокировка тогда
			Если Выборка.ДатаБлокировки >= НачалоДня(ЭтотОбъект.Дата) Тогда
				Возврат Ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат истина;
КонецФункции


Функция ВыполнитьСозданиеНакладныхНаОтгузку(Дата, ДатаНач, ПорядокВыбораДня, СуммаОценкиДляОтбора)
	ПроверятьЛомбард = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.Ломбард) Тогда 
		ПроверятьЛомбард = Истина;
	КонецЕсли;                	
	
	СтатусыЗБ = новый СписокЗначений; 
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен); 
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен);
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен); 
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят);
	СтатусыЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство);
	
	ЗапросЗБ = Новый Запрос;  
	ЗапросЗБ.УстановитьПараметр("Дата", Дата); 
	ЗапросЗБ.УстановитьПараметр("СтатусыЗБ", СтатусыЗБ); 
	ЗапросЗБ.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	                 |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	                 |ГДЕ
	                 |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета В(&СтатусыЗБ)
	                 |	И ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";  
	Если ПроверятьЛомбард Тогда
		ЗапросЗБ.Текст = ЗапросЗБ.Текст + "
	                 |	И ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет.Ломбард = &Ломбард";
	КонецЕсли;	
	СписокЗБ = новый СписокЗначений;
    ВыборкаЗБ = ЗапросЗБ.Выполнить().Выбрать();
	Пока ВыборкаЗБ.Следующий() Цикл   
		//проверим попадает ли ЗБ в установленный перид выбора дня
		Если ВыборкаЗБ.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда  
			Если НЕ ПроверитьЗБНаследство(ВыборкаЗБ.ЗалоговыйБилет, Дата) Тогда
				Продолжить;
			КонецЕсли;	
		//+Мельников 04.07.24
		ИначеЕсли ПроверитьКлиентаНаБанкротство(ВыборкаЗБ.ЗалоговыйБилет, Дата) Тогда
			Продолжить;
		//+Мельников 08.07.24
		ИначеЕсли ЛБ_ОбщегоНазначения.ПроверитьПоПеречням(Дата, ВыборкаЗБ.ЗалоговыйБилет) Тогда
			Продолжить;
		//-Мельников    
	    ИначеЕсли НЕ ПроверитьНетБлокировки(ВыборкаЗБ.ЗалоговыйБилет, Дата) Тогда
		    Продолжить;
		Иначе	
			ДатаПроверки = КонецДня(ВыборкаЗБ.ДатаВыкупаЛьготныйСрок) + 1;
			Если ПорядокВыбораДня > 0 Тогда 
				ДатаПроверки = ДатаПроверки + ПорядокВыбораДня*7*24*60*60;
			КонецЕсли;		
			Если НачалоДня(ДатаНач) < ДатаПроверки Тогда
				Продолжить
			КонецЕсли;	
		КонецЕсли;  
        СписокЗБ.Добавить(ВыборкаЗБ.ЗалоговыйБилет);
	КонецЦикла;	
	
	СтатусыОЗ = новый СписокЗначений; 
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен); 
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
    СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство);
	
	ЗапросЗБ.УстановитьПараметр("СписокЗБ", СписокЗБ); 
	ЗапросЗБ.УстановитьПараметр("СтатусыОбъектаЗалога", СтатусыОЗ);
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                 |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтказОтВыкупа КАК ОтказОтВыкупа,
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес
	                 |ИЗ
	                 |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_ОбъектыЗалогаОстатки
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	                 |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                 |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                 |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                 |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                 |ГДЕ
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога В(&СтатусыОбъектаЗалога)";         
	ТаблицаЗапроса = ЗапросЗБ.Выполнить().Выгрузить();
	ТаблицаФормированияНакладных = ТаблицаЗапроса.СкопироватьКолонки("Ломбард, ЗалоговыйБилет, ОтказОтВыкупа, ОбъектЗалога, Количество, Вес, СуммаОценки");
	ТаблицаФормированияНакладных.Колонки.Добавить("ПовышеннаяОценка");
	
	Для каждого Стр из ТаблицаЗапроса Цикл 		
		НоваяСтр = ТаблицаФормированияНакладных.Добавить(); 
		НоваяСтр.Ломбард = Стр.Ломбард;  
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		НоваяСтр.ОтказОтВыкупа = Стр.ОтказОтВыкупа;
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;  
		НоваяСтр.Вес = Стр.Вес;
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
		НоваяСтр.ПовышеннаяОценка = Ложь;
		Если Стр.СуммаОценки > СуммаОценкиДляОтбора тогда  
			НоваяСтр.ПовышеннаяОценка = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаЛомбардов = ТаблицаФормированияНакладных.Скопировать();
	ТаблицаЛомбардов.Свернуть("Ломбард");
	
	Отбор1 = Новый Структура; 
    Отбор2 = Новый Структура;  
	
	КолНакладных = 0;   
	Для каждого СтрЛ Из ТаблицаЛомбардов Цикл 
		Отбор1.Вставить("Ломбард", СтрЛ.Ломбард);
		Отбор1.Вставить("ОтказОтВыкупа", Истина);
		Отбор1.Вставить("ПовышеннаяОценка", Ложь);
		
		Сдвиг = 0;
		Строки1 = ТаблицаФормированияНакладных.НайтиСтроки(Отбор1); 
		Если НЕ Строки1.Количество() = 0  Тогда
			СформироватьНакладную(Дата, СтрЛ.Ломбард, Строки1, Истина, Ложь);
			КолНакладных = КолНакладных + 1; 
			Сдвиг = Сдвиг + 1;
		КонецЕсли;  
		
		Отбор1.Вставить("ПовышеннаяОценка", Истина);
		
		Строки1 = ТаблицаФормированияНакладных.НайтиСтроки(Отбор1); 
		Если НЕ Строки1.Количество() = 0  Тогда
			СформироватьНакладную(Дата, СтрЛ.Ломбард, Строки1, Истина, Истина, Сдвиг);
			КолНакладных = КолНакладных + 1; 
			Сдвиг = Сдвиг + 1;
		КонецЕсли;
		
		Отбор2.Вставить("Ломбард", СтрЛ.Ломбард);
		Отбор2.Вставить("ОтказОтВыкупа", Ложь); 
		Отбор2.Вставить("ПовышеннаяОценка", Ложь);
		
		Строки2 = ТаблицаФормированияНакладных.НайтиСтроки(Отбор2); 
		Если НЕ Строки2.Количество() = 0  Тогда
			СформироватьНакладную(Дата, СтрЛ.Ломбард, Строки2, Ложь, Ложь, Сдвиг); 
			КолНакладных = КолНакладных + 1;  
			Сдвиг = Сдвиг + 1;
		КонецЕсли;
		
		Отбор2.Вставить("ПовышеннаяОценка", Истина);
		
		Строки2 = ТаблицаФормированияНакладных.НайтиСтроки(Отбор2); 
		Если НЕ Строки2.Количество() = 0  Тогда  
			СформироватьНакладную(Дата, СтрЛ.Ломбард, Строки2, Ложь, Истина, Сдвиг);    
			КолНакладных = КолНакладных + 1;
		КонецЕсли;
	КонецЦикла;	                            
	Возврат КолНакладных;
КонецФункции

Процедура СформироватьНакладную(Дата, Ломбард, СтрокиТаблицы, ОтказОтВыкупа, ПовышеннаяОценка, Сдвиг = 0) 
	НовыйДок = Документы.ЛБ_НакладнаяНаОтгрузку.СоздатьДокумент();
	НовыйДок.Дата = Дата + Сдвиг; 
	НовыйДок.Организация = ЭтотОбъект.Организация;
	НовыйДок.Ломбард = Ломбард;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Автоматически;
	НовыйДок.ОтказОтВыкупа = ОтказОтВыкупа;
	НовыйДок.ПовышеннаяОценка = ПовышеннаяОценка;  
	НовыйДок.ДокументНастроек = ДокументНастроек;
	
	Для каждого Стр Из СтрокиТаблицы Цикл 
		НоваяСтр = НовыйДок.Залоги.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;
		НоваяСтр.Вес = Стр.Вес;
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	КонецЦикла;		
	
	НовыйДок.НомерНакладной = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерНакладнойНаОтгрузку(НовыйДок.Дата, НовыйДок.Организация, НовыйДок.Ломбард);   
	НовыйДок.ПредставлениеНомераНакладной = СокрЛП(НовыйДок.Ломбард.НомерЛомбарда) + "/" +  СокрЛП(НовыйДок.НомерНакладной) + ?(НовыйДок.ПовышеннаяОценка, "/Т", "");
	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;	
КонецПроцедуры	

ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
ДокументНастроек = Документы.ЛБ_УстановкаНастроекСозданияНакладныхНаОтгрузку.ПустаяСсылка();
